Revit 2027 API
PathOfTravelCalculationServerIds.DefaultPathOfTravelCalculationGUID Property
 GUID to represent the default calculation server id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid DefaultPathOfTravelCalculationGUID { get; }
Public Shared ReadOnly Property DefaultPathOfTravelCalculationGUID As Guid
	Get
public:
static property Guid DefaultPathOfTravelCalculationGUID {
	Guid get ();
}
static member DefaultPathOfTravelCalculationGUID : Guid with get
Property Value
Guid
See Also
Reference
PathOfTravelCalculationServerIds Class
Autodesk.Revit.DB.Analysis Namespace